'use clinet'
import TwistAPlayerWraper from '../twist-aplayer'
import type { AudioInfo } from 'twist-aplayer'
import { useMemo } from 'react'
import { useIsMobile } from '@/hooks/useIsMobile'

function LayoutAplayer() {
  const isMobile = useIsMobile()
  const layoutAudioList: AudioInfo[] = useMemo(() => ([
    {
      name: 'Special One',
      artist: 'AGA / Eason',
      url: 'https://assets.razzh.cn/audio/special-one.mp3',
      cover: 'https://y.qq.com/music/photo_new/T002R300x300M000002BWT984d0xsP_2.jpg?max_age=2592000',
      lrc: '[00:25.70]A: 行为怪诞无从触摸 常人配你不起\n[00:31.95]你有触角你会黑面十全十美\n[00:38.33]旁人冷语为何一起 旁人劝我心死\n[00:44.73]你更失控我更喜爱怪人像你\n[00:50.53]A: 天生孤僻所以更爱你 E:（越接触你）\n[00:53.40]A: 不依规则的爱更细腻 E:（越吓惊你）\n[00:56.56]A: 和你相比 难以相比 庸俗的美 E:（和我相比 难以欢喜 庸俗心理）\n[01:03.41]A: 让你羡慕自己 E:（别要待薄自己）\n[01:07.03]A: 非一般的完美 E:（要吞声忍气）\n[01:09.98]A: 羊群如何离弃\n[01:13.51]A: 打击你我包庇 E:（打击我你包庇）\n[01:16.65]A: 惨得过是我欢喜 E:（只不过代价不菲）\n[01:21.59]A: 笑着去迎合你 E:（自欺）\n[01:28.96]A: 做你像做自己 E:（面对大量是非）\n[01:32.77]A: 我喜欢听歪理 E:（对你很多不利）\n[01:35.69]A: 情人毫无常理 另有趣味 E:（未免乏味）\n[01:42.61]A: 享受怪物美\n[01:47.36]E: 欣赏我委屈你\n[01:55.45]合: 遗忘世界遗忘标准 离群更有惊喜\n[02:01.60]A: 爱你的我怪兽一样合情合理 E:（一样合情合理）\n[02:07.18]A: 彼此天生荒诞我似你 E:（越疼惜你）\n[02:10.51]A: 一起根本不要太贴地 E:（越怕伤你）\n[02:13.56]A: 神化一起 奇怪一起 离地嬉戏 E:（神化一起 奇怪一起 难敌风气）\n[02:20.12]A: 让你羡慕自己 E:（别要待薄自己）\n[02:23.98]A: 非一般的完美 E:（要吞声忍气）\n[02:26.87]A: 羊群如何离弃\n[02:30.47]A: 打击你我包庇 E:（打击我你包庇）\n[02:33.81]A: 惨得过是我欢喜 E:（只不过代价不菲）\n[02:38.51]A: 笑着去迎合你 E:（自欺）\n[02:45.95]A: 做你像做自己 E:（面对大量是非）\n[02:49.51]A: 我喜欢听歪理 E:（对你很多不利）\n[02:52.41]A: 情人毫无常理 另有趣味 E:（未免乏味）\n[02:59.45]合: 享受怪物美 欣赏你这种美\n[03:04.25]合: 情感本应古怪 喜不喜欢为何尚有顾忌\n[03:30.67]E: 让我羡慕自己 也许超出歪理 A:（这么辛苦你）\n[03:37.75]E: 是你离奇神化 喜欢我怪的美 A:（喜欢你美不美）\n[03:43.99]A: 蝙蝠与异兽一起 E:（蝙蝠与异兽一起）\n[03:48.71]合: 你像我怪癖 怪物最明白你\n[03:56.37]E: 做个独特自己 爱多么的诡秘 A:（爱多么的诡秘）\n[04:02.84]E: 情人离奇神秘 越有趣味 A:（越有趣味）\n[04:10.06]合: 享受你是你 不必世界审美\n[04:19.64]不用说道理\n[04:24.50]A: 只因怪得起 E:（怪得起）\n'
    },
    {
      name: '听你说',
      artist: {
        name: '梁博',
        url: 'https://music.163.com/#/artist?id=166010'
      },
      url: 'https://assets.razzh.cn/audio/tingnishuo.mp3',
      cover:
        'https://y.qq.com/music/photo_new/T002R300x300M000001k9PMK2WjbjX_1.jpg?max_age=2592000',
      lrc: '[00:03.14]听你说 - 梁博\n[00:06.91]词：梁博\n[00:09.61]曲：梁博\n[00:37.79]你的壳 像钻石一样硬\n[00:44.97]你的心 软弱到无形\n[00:51.74]你的事 像风雪里的冰 清醒我至今\n[00:59.71]只是你 有一点点疼\n[01:04.27]听你说 听你说你有一点点疼\n[01:13.93]你觉得 我会不会心疼\n[01:21.18]每个夜 你提着一盏灯\n[01:25.70]问我几点钟到黎明\n[01:28.46]我只能与你同行\n[01:46.31]先要去感受泥泞\n[01:53.43]才能够步履轻盈\n[02:00.60]你看你 小小一个人 为何不害羞\n[02:07.57]敢去唱这世间风情\n[02:12.15]听你说 听你说这有一点点疼\n[02:21.68]你觉得 我会不会心疼\n[02:29.01]每个夜 你提着一盏灯\n[02:33.62]问我几点钟到黎明\n[02:36.30]我只能与你同行\n[02:43.26]有个人\n[02:44.94]在阳光下播种\n[02:47.78]万里粮田为美梦\n[02:50.38]种下爱驱散乌云和痛\n[02:54.92]千分之一也敢做\n[02:58.33]梦里登上过山车\n[03:01.95]雨里游过了小河\n[03:05.67]已置换时空\n'
    }
  ]), [])

  return (
    !isMobile ? (
      <TwistAPlayerWraper
        audio={layoutAudioList}
        appearance='fixed'
        mini
        listFolded
        mutex
      />
    ) : null
  )
}

export default LayoutAplayer